package com.yubin.news.utils;

import java.util.Collection;
import java.util.Map;
import java.util.Random;

/**
 * Created by YUBIN on 2016/4/3.
 */

public class WorkerUtil {

    /**
     * 检测对象是否为空
     * @param obj
     * @return
     */
    public static boolean isNullOrEmpty(Object obj) {
        if (obj == null) {
            return true;
        }
        if (obj instanceof String) {
            if (obj.toString().equals("")) {
                return true;
            }
        }
        if (obj instanceof Collection) {
            if (((Collection) obj).size() == 0) {
                return true;
            }
        }
        if (obj instanceof Map) {
            if (((Map) obj).size() == 0) {
                return true;
            }
        }
        if (obj instanceof StringBuffer) {
            if (((StringBuffer) obj).length() == 0) {
                return true;
            }
        }
        return false;
    }


    /**
     * 加入错误娱乐信息
     *
     * @param message
     * @return
     */
    public static String getMessage(String message) {
        String[] info = { "HOHO！", "~\\(≧▽≦)/~", "我靠！", "刮风啦下雨啦大家收衣服啊！",
                "这是为什末呢？", "输给你了！", "想作弊？", "楼主快回火星吧！", "哥们儿三思啊！", "乖~再试一次！",
                "呼~差一点~", "你中奖了！", "异想天开？", "很遗憾~", "我不玩了！",
                "人是人他妈生的，妖是妖他妈生的……", "再错请我吃饭！", "I 服了 U", "你厉害！", "去，面壁思过5分钟！",
                "……无语", "我不信是你按错了……", "O(∩_∩)O", "何必呢？", "晕……", "何苦呢？",
                "有意思吗？", "今天天气不错啊~", "(*^__^*)", "看你气色不太好，病了？", "( ⊙ o ⊙ )",
                "去洗把脸吧！清醒一下！", "╮(╯﹏╰）╭", "我很同情你！", "(*^◎^*)", "我也是被逼的！",
                "(=@__@=)", "你要冷静！", "在哪跌倒，就在哪躺下！", "别乱来，我要叫啦！", "搞什么飞机？",
                "Oh, my God!" };
        if (message != null) {
            int i = new Random().nextInt(info.length);
            return message.concat(info[i]);
        } else {
            return null;
        }
    }


    /**
     * 随机获取一个淫荡的娱乐信息
     * @return
     */
    public static String getYuleMessage() {
        String[] info = { "HOHO！", "~\\(≧▽≦)/~", "我靠！胸这么小。。",
                "刮风啦，下雨啦，大家快回家收衣服啊！", "这是为什末呢？", "输给你了！", "你想作弊？带上我吧。。",
                "楼主快回火星吧！", "哥们儿三思啊！", "乖~再试一次！", "呼~差一点~",
                "卧槽，你中奖了！。。奖你丫的一锤子！", "异想天开？", "很遗憾~", "真是日了狗了。。", "没事别瞎BB。。",
                "哎哟，不错哦。。。", "别激动，让我先去尿一个。。", "我不玩了！", "人是人他妈生的，妖是妖他妈生的……",
                "再错请我吃饭！", "I 服了 U", "你厉害！", "去，面壁思过5分钟！", "……无语",
                "我不信是你按错了……", "O(∩_∩)O", "何必呢？", "晕……", "何苦呢？", "有意思吗？",
                "今天天气不错啊~", "(*^__^*)", "看你气色不太好，病了？快用妇炎洁。。", "你肾亏吧？快用斯达舒。。",
                "( ⊙ o ⊙ )", "去洗把脸吧！清醒一下！", "╮(╯﹏╰）╭", "我很同情你！", "(*^◎^*)",
                "我也是被逼的！", "(=@__@=)", "喂，那个SB，你的鞋带散了！", "你要冷静！",
                "在哪跌倒，就在哪躺下！", "别乱来，我要叫啦！", "搞什么飞机？", "Oh, my God。。",
                "有种来打我啊！", "我想去尿尿。。。", "你丑到我了，离我远点！", "小心我用千年杀！", "别逼我用色诱之术！",
                "我要去上课了。。", "你又迟到了。。", "禽兽！放开那妹子，让我来！", "我去，你谁啊？", "我要当学霸！",
                "嘘，低调点。。", "我忍不住想装逼了，怎么办？", " 别扯那么远，蛋会碎的。。。",
                "台湾一日没有收复，我一日不过四级！", "我要去上自习了。。", "咦？我的书哪去了。。",
                "我那么帅有个屁用啊！到头来还不是没钱花。。。", "求包养。。", "吃，吃，吃，就知道吃!", "走，去吃饭。",
                "你们继续。。", "我只是来打酱油的。。", "帮我去图书馆占个座吧？。。", "我去！你的高数又挂了？恭喜啊。。",
                "来，来，都来打牌！", "今晚不醉不归！", "谁帮我去考四级，我帮他吃饭！", "哟，这妹子不错哦。。",
                "哟！哟！切克闹！这个逗比有一套！", "别睡了，嗨起来！", "又有谁能够理解一个学弱的痛苦呢。。。",
                "卧槽！，又到考试周了，好紧张啊。。", "我决定去卖烧饼了！", "如果我爆照，你们会不会打我？", "有种带我去装逼！",
                "Hi,man....fuck you!", "别管我，让我静一下。。", "你jj太小就别说话！",
                "你胸那么小还敢这么嚣张？", "哟呵，你胸那么大不让摸还有理了？", "十动然拒又撕逼，也是醉了你麻痹。。",
                "挖掘技术哪家强？", "怪我咯。。", "做一个明媚的女子，去四处浪荡。。",
                "你虽然心地善良，但是外表丑陋。。( ⊙ o ⊙ )", "别再潜水了，都出来扯蛋吧！", "表酱紫嘛。。",
                "╮(╯﹏╰）╭你们城里人真会玩...", "不作死就不会死！", "萌萌哒...", "我整个人都不好了..",
                "我只想做个安静的美男子...偶尔约个炮", "你们也是蛮拼的。。", "我也是醉了。。",
                "你复杂的五官，掩饰不了你朴素的智商。", "你那么屌，然而并没有什么卵用。。", "不作死就不会死啊",
                "你们乡下人话真多。。", "你是弯的吧？", "你们说的好有道理啊，我竟无言以对。。", "我的内心其实是崩溃的。。。",
                "楼上的！你的内裤掉了。。", "一群傻逼！", "不用说，一看就知道你是三鹿喝多了",
                "卧槽！有种别跑！", "Hi,man...fuck you!", "禽兽！放开那妹子，让我来！",
                "快走开，你丑到我了。。", "你这贱人！", "you 那么丑，也敢出来贱人？", "贱人,滚开！你丑到我了！！",
                "骚年，还记得我们一起去嫖妓的岁月吗？", "fuck you!", "嗨你麻痹，小心我给你一锤子！",
                "别以为你长得丑我就不敢打你！", "别在我前面装逼，小心我砍你！", "你继续，不要停。",
                "求你了，别跟我说话，我有傻逼恐惧症。。", "朋友别怕，我并不是什么好人。。", "你少给老子放屁！",
                "慢着！等我穿好盔甲。", "你他妈在逗我？", "退后！让我宰了他！", "小心我日了你这条狗！",
                "像你这种人，在电视剧里面最多活两集。", "我真的是来投降的。。", "卧槽，你为何这么屌？",
                "老子一拳把你打成傻逼！", "你滚开！我要开始装逼了！", "你不就是那天掉进粪坑的那孩子吗？ ",
                "别打脸，我投降还不行吗？", "我最讨厌那些骂人的人了，他妈的！ ", "下面请傻逼发言。。", "雅蠛蝶。。",
                "楼上的是一个傻逼。", "你以为我不叫你傻逼，你就真的不是傻逼么？自信点！你就是傻逼！", "给你250，快给老子滚！",
                "这位兄台，你的傻逼证掉了！", "卧槽！别摸老子jj。。 ", "我那个艹，吓死老子了。。 ", "老子一粪瓢扣死你！",
                "你胸那么大不让摸还有理了？", "你活不过今天了，我马上叫人打你！", "劳资就问你约不约？！",
                "大胆妖孽！吃俺老孙一黄瓜！", "禽兽！放开我的小j j啊。。", "你这脑残的家伙！",
                "我一看就知道你不是一个好东西！", "你真不要脸。", "要想活命，快快投降！", "朋友，你该吃药了。。",
                "你还在装逼啊？累不累啊？。。", "我有一百种方法让你呆不下去，因为，我叫叶良辰！"

        };
        String message = "";
        int i = new Random().nextInt(info.length);
        return message.concat(info[i]);

    }
}
